#!/bin/bash

# 字符串

# 双引号允许解释字符串中出现的特殊字符; 但是单引号不会做任何解释
echo "the var: $var"
echo 'the var: $var'

# 在双引号字符串中可以使用转义字符(\)来实现字符转义
echo "the var: \$var"

# 使用 printf 格式化输出, 接受引用文本和由空格分割的参数
printf "%-5s %-10s %-4s\n" No Name Mark
printf "%-5s %-10s %-4.2f\n" 1 Sarath 80.3456
printf "%-5s %-10s %-4.2f\n" 2 James 90.9989
printf "%-5s %-10s %-4.2f\n" 3 Jeff 77.564

# ==================================================
# echo 和 printf 的命令选项
# ==================================================

# echo -n 会禁止 echo 命令的尾部换行
echo -n "no Line-Feed"
# echo -e 支持使用转义序列
echo "1\t2\t3"
echo -e "1\t2\t3"
# 使用 echo -e 打印颜色输出
# 常用的文本颜色: 0:重置, 30:黑色, 31:红色, 32:绿色, 33:黄色, 34:蓝色, 35:洋红, 36:青色, 37:白色,
# 常用的背景颜色: 0:重置, 40:黑色, 41:红色, 42:绿色, 43:黄色, 44:蓝色, 45:洋红, 46:青色, 47:白色,
echo -e "\e[1;31m This is red text\e[0m"
echo -e "\e[1;47m This is white background\e[0m"

# ==================================================
# 字符串截取
# ==================================================

# 删除从左边开始到第一个匹配 regex 位置的字符
echo ${var#*//}

# 删除从左边开始到最后一个匹配 regex 位置的字符
echo ${var##*//}

# 删除从右边开始到第一个匹配 regex 位置的字符
echo ${var%//*}

# 删除从右边开始到最后一个匹配 regex 位置的字符
echo ${var%%//*}

# 删除从左边第 m 个字符开始 n 个字符个数
echo ${var:0:5}

# 删除从左边第 m 个字符开始到结束为止
echo ${var:7}

# 删除从右边第 m 个字符开始 n 个字符个数
echo ${var:0-7:3}

# 删除从右边第 m 个字符开始到结束为止
echo ${var:0-7}

